Revit 2027 API
ParameterTypeId.OriginatingElementName Property
 "Originating Element"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId OriginatingElementName { get; }
Public Shared ReadOnly Property OriginatingElementName As ForgeTypeId
	Get
public:
static property ForgeTypeId^ OriginatingElementName {
	ForgeTypeId^ get ();
}
static member OriginatingElementName : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace